system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;
backgroundMesh
{
    size    1;
	xMin   0; 
    xMax   90;
    zMin   -3; 
    zMax   30;
    yMin   0;
    yMax   80;
    xCells  #calc "std::floor( ( $xMax - $xMin ) / $size )";
    yCells  #calc "std::floor( ( $yMax - $yMin ) / $size )";
    zCells  #calc "std::floor( ( $zMax - $zMin ) / $size)";
}


vertices
(
    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMin)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMin)

    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMax)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMax)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) 
    (
        $:backgroundMesh.xCells
        $:backgroundMesh.yCells
        $:backgroundMesh.zCells
    )
	simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
	side
    {
        type patch;
        faces
        (
			(3 7 6 2)
			(1 5 4 0)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
	
	top
    {
        type patch;
        faces
        (    
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
