constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          2400;
        startFace       634452;
    }
    outlet
    {
        type            patch;
        nFaces          2400;
        startFace       636852;
    }
    side
    {
        type            patch;
        nFaces          5400;
        startFace       639252;
    }
    top
    {
        type            patch;
        nFaces          7200;
        startFace       644652;
    }
    air_to_buildings
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          256;
        startFace       651852;
        sampleMode      nearestPatchFace;
        sampleRegion    buildings;
        samplePatch     buildings_to_air;
    }
    air_to_soil3
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          7136;
        startFace       652108;
        sampleMode      nearestPatchFace;
        sampleRegion    soil3;
        samplePatch     soil3_to_air;
    }
)

// ************************************************************************* //
