constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          2640;
        startFace       699990;
    }
    outlet
    {
        type            patch;
        nFaces          2640;
        startFace       702630;
    }
    side
    {
        type            patch;
        nFaces          5940;
        startFace       705270;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7200;
        startFace       711210;
    }
    top
    {
        type            patch;
        nFaces          7200;
        startFace       718410;
    }
)

// ************************************************************************* //
