constant/soil2/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/soil2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       14230;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       14310;
    }
    side
    {
        type            patch;
        nFaces          180;
        startFace       14390;
    }
    soil2_to_soil1
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          7200;
        startFace       14570;
        sampleMode      nearestPatchFace;
        sampleRegion    soil1;
        samplePatch     soil1_to_soil2;
    }
    soil2_to_soil3
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          7200;
        startFace       21770;
        sampleMode      nearestPatchFace;
        sampleRegion    soil3;
        samplePatch     soil3_to_soil2;
    }
)

// ************************************************************************* //
