constant/soil3/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/soil3/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       14230;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       14310;
    }
    side
    {
        type            patch;
        nFaces          180;
        startFace       14390;
    }
    soil3_to_buildings
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          64;
        startFace       14570;
        sampleMode      nearestPatchFace;
        sampleRegion    buildings;
        samplePatch     buildings_to_soil3;
    }
    soil3_to_air
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          7136;
        startFace       14634;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_soil3;
    }
    soil3_to_soil2
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          7200;
        startFace       21770;
        sampleMode      nearestPatchFace;
        sampleRegion    soil2;
        samplePatch     soil2_to_soil3;
    }
)

// ************************************************************************* //
