constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



//add souce terms with customed code
USource
{
    type              USource;
	fields            (U);
    selectionMode     cellZone;// all, cellSet, cellZone, points
	cellZone          tree_cube_1;
}

kSource
{
    type              kSource;
	fields            (k);
    selectionMode     cellZone;// all, cellSet, cellZone, points
	cellZone          tree_cube_1;
}

epsilonSource
{
    type              epsilonSource;
	fields            (epsilon);
    selectionMode     cellZone;// all, cellSet, cellZone, points
	cellZone          tree_cube_1;
}	

ESource
{
    type              ESource;
	fields            (h);
    selectionMode     cellZone;// all, cellSet, cellZone, points
	cellZone          tree_cube_1;
}	

specHumSource
{
    type              specHumSource;
	fields            (specHum);
    selectionMode     cellZone;// all, cellSet, cellZone, points
	cellZone          tree_cube_1;
}	
// ************************************************************************* //
