0.orig/air/TLeaf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 310;

boundaryField
{
    air_to_soil3
    {
        type            zeroGradient;
    }	
	
    top
    {
        type            inletOutlet;
        value           uniform 310;
        inletValue      uniform 310;
    }
    side
    {
        type            inletOutlet;
        value           uniform 310;
        inletValue      uniform 310;
    }
	inlet
    {
        type            inletOutlet;
        value           uniform 310;
        inletValue      uniform 310;
    }

    outlet
    {
        type            inletOutlet;
        value           uniform 310;
        inletValue      uniform 310;
    }
	
	air_to_buildings
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
