0.orig/air/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
epsilonInlet  0.01; // Cmu^0.75 * k^1.5 / L ; L =10
dimensions      [0 2 -3 0 0 0 0];


internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $epsilonInlet;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $epsilonInlet;
        value           uniform $epsilonInlet;
    }
    side
    {
        type            zeroGradient;
    }
    air_to_soil3
    {
        type            epsilonWallFunction;
        value           uniform $epsilonInlet;
    }
    top
    {
        type            zeroGradient;
    }
    air_to_buildings
    {
        type            epsilonWallFunction;
        value           uniform $epsilonInlet;
    }
}


// ************************************************************************* //
