0.orig/air/specHum
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      specHum;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   uniform 0.016;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    outlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    side
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    air_to_soil3
    {
        type            zeroGradient;
    }
    top
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    air_to_buildings
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
