0.orig/soil3/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            zeroGradient;
        value           uniform 300;
    }
    outlet
    {
        type            zeroGradient;
        value           uniform 300;
    }
    side
    {
       type            zeroGradient;
        value           uniform 300; 
    }
    soil3_to_buildings
    {
       type            zeroGradient;
        value           uniform 300;
    }
	soil3_to_air
    {
        type            fixedValue;
        value           uniform 300;
    }
    soil3_to_soil2
    {
       type            fixedValue;
       value           uniform 300;
    }
}


// ************************************************************************* //
