system/soil1/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
        buildings
        {
            type            wall;
			inGroups        1 ( wall );
        }
		ground
        {
            type            mappedWall;
            sampleMode      nearestPatchFace;
            samplePatch     bottom;
            sampleRegion    soil;
            coupleGroup     ground_baffle;

            offsetMode      uniform;
            offset          (0 0 0);
        }
}

// ************************************************************************* //
